Revit 2026 API

# ReferenceEqualTo Method

---

Checks if given reference is equal to this reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool EqualTo(
	Reference reference
)
```
```vb
Public Function EqualTo (
	reference As Reference
) As Boolean
```
```cpp
public:
bool EqualTo(
	Reference^ reference
)
```
```fsharp
member EqualTo :
        reference : Reference -> bool
```

#### Parameters

reference Reference
    Another reference.

#### Return Value

BooleanReturns true if given reference is equal to this reference, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when argument is . |

#### Reference

Reference Class

Autodesk.Revit.DB Namespace